In [1]:
import numpy as np
import pandas as pd

In [14]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,np.nan,350]}

In [15]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl    NaN
5      FB    Sarah  350.0

In [16]:
grpby = df.groupby('Company')

In [17]:
grpby.mean()

         Sales
Company
FB       350.0
GOOG     160.0
MSFT     232.0

In [11]:
grpby.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [18]:
df.groupby('Company').describe() #Get various statistics about the dataframe

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        1.0  350.0         NaN  350.0  350.0  350.0  350.0  350.0
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

In [19]:
#pd.concat([df,df1],axis=0) #Join DataFrames by rows
#pd.merge(left, right, how='inner', on=['key1','key2']) #Merge df by key 
#df1.join(df2, how='outer') # Joins on index

In [22]:
df['Sales'].unique()  #Fetches unique values from a Col

array([ 200.,  120.,  340.,  124.,   nan,  350.])

In [23]:
df['Sales'].nunique() #Fetches count of unique values from a Col

5

In [25]:
df['Sales'].value_counts() #Count of each unique value

350.0    1
124.0    1
340.0    1
120.0    1
200.0    1
Name: Sales, dtype: int64

In [30]:
#User defn function
def sqr(x):
    return x*x

In [32]:
sqr(100)

10000

In [39]:
df['Sales'].apply(sqr)

0     40000.0
1     14400.0
2    115600.0
3     15376.0
4         NaN
5    122500.0
Name: Sales, dtype: float64

In [68]:
df['New_Sales'] = df['Sales']*2
df

  Company   Person  Sales  New_Sales
0    GOOG      Sam  200.0      400.0
1    GOOG  Charlie  120.0      240.0
2    MSFT      Amy  340.0      680.0
3    MSFT  Vanessa  124.0      248.0
4      FB     Carl    NaN        NaN
5      FB    Sarah  350.0      700.0

In [69]:
df[['Sales','New_Sales']].apply(sqr)

      Sales  New_Sales
0   40000.0   160000.0
1   14400.0    57600.0
2  115600.0   462400.0
3   15376.0    61504.0
4       NaN        NaN
5  122500.0   490000.0

In [50]:
df.drop('New_Sales', axis=1,inplace=True)
df

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl    NaN
5      FB    Sarah  350.0

In [53]:
df.columns #get col names
df.index  # Get indices

RangeIndex(start=0, stop=6, step=1)

In [55]:
df.sort_values('Sales',ascending=False)  #Sorting on a col

  Company   Person  Sales
5      FB    Sarah  350.0
2    MSFT      Amy  340.0
0    GOOG      Sam  200.0
3    MSFT  Vanessa  124.0
1    GOOG  Charlie  120.0
4      FB     Carl    NaN

In [58]:
df.isnull().sum()  #Gives the null count per col

Company    0
Person     0
Sales      1
dtype: int64

In [60]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df1 = pd.DataFrame(data)
df1

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [66]:
df1.pivot_table(values='D',index=['A','B'], columns=['C']) #Creating a Pivot table

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN